In [1]:
library(tidyverse)
fname = file.path("ME315", "voos", "flights_small.csv.zip")
file.exists(fname)

── Attaching packages ─────────────────────────────────────── tidyverse 1.2.1 ──
✔ ggplot2 3.2.0     ✔ purrr   0.3.2
✔ tibble  2.1.3     ✔ dplyr   0.8.3
✔ tidyr   0.8.3     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.4.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

[1] TRUE

In [2]:
#Exemplo 1: Leitura em partições

input = read_csv(fname, n_max = 1000)
input %>% head

Parsed with column specification:
cols(
  .default = col_double(),
  AIRLINE = col_character(),
  TAIL_NUMBER = col_character(),
  ORIGIN_AIRPORT = col_character(),
  DESTINATION_AIRPORT = col_character(),
  SCHEDULED_DEPARTURE = col_character(),
  DEPARTURE_TIME = col_character(),
  WHEELS_OFF = col_character(),
  WHEELS_ON = col_character(),
  SCHEDULED_ARRIVAL = col_character(),
  ARRIVAL_TIME = col_character(),
  CANCELLATION_REASON = col_character()
)
See spec(...) for full column specifications.

  YEAR MONTH DAY DAY_OF_WEEK AIRLINE FLIGHT_NUMBER TAIL_NUMBER ORIGIN_AIRPORT
1 2015 7      8  3           WN      2414          N8634A      DEN
2 2015 3     11  3           US      1850          N187US      PHL
3 2015 8      4  2           MQ      3429          N663MQ      CMI
4 2015 6      4  4           AS       658          N409AS      SEA
5 2015 4      7  2           DL      1061          N3758Y      LAX
6 2015 7     17  5           DL       913          N317US      TVC
  DESTINATION_AIRPORT SCHEDULED_DEPARTURE ⋯ ARRIVAL_TIME ARRIVAL_DELAY DIVERTED
1 MCO                 0650                ⋯ 1225           0           0
2 MCO                 0650                ⋯ 0913         -17           0
3 ORD                 0710                ⋯ 0752         -31           0
4 DFW                 0645                ⋯ 1225         -15           0
5 MCO                 1025                ⋯ 1821          18           0
6 MSP                 1627                ⋯ 1641          -8           0
  CANCELLED CANCELLATION_REASON AIR_SYSTEM_DELAY SECURITY_DELAY AIRLINE_DELAY
1 0         NA                  NA               NA             NA
2 0         NA                  NA               NA             NA
3 0         NA                  NA               NA             NA
4 0         NA                  NA               NA             NA
5 0         NA                   0                0              2
6 0         NA                  NA               NA             NA
  LATE_AIRCRAFT_DELAY WEATHER_DELAY
1 NA                  NA
2 NA                  NA
3 NA                  NA
4 NA                  NA
5 16                   0
6 NA                  NA

In [8]:
# Aqui estou querendo calcular a quantidade de voos mensais por companhia aérea
# Para tanto: 1) agrupamos por MONTH e AIRLINE e 2) somamos a quantidade de voos
# Para o item 2) podemos utilizar summarize, count ou tally

#Aqui estamos utilizando apenas as 1000 primeiras linhas do banco de dados

res1 = input %>% drop_na(MONTH, AIRLINE) %>%
    group_by(MONTH, AIRLINE) %>%
    tally()

In [5]:
#Agora, vamos criar uma função para iniciar a leitura por partições.
#Anteriormente estudamos as 1000 linhas. Agora, iremos ler essas mil linhas usando o príncipio de partições.

#Criando função getStats
#Observe que o código DENTRO DA FUNÇÃO é o mesmo que criamos anteriormente!!!
getStats = function(inout, pos){
    input %>% drop_na(MONTH, AIRLINE) %>%
        group_by(MONTH, AIRLINE) %>%
        tally()
}

suficientes = read_csv_chunked(fname, chunk_size = 1000, callback = DataFrameCallback$new(getStats))

Parsed with column specification:
cols(
  .default = col_double(),
  AIRLINE = col_character(),
  TAIL_NUMBER = col_character(),
  ORIGIN_AIRPORT = col_character(),
  DESTINATION_AIRPORT = col_character(),
  SCHEDULED_DEPARTURE = col_character(),
  DEPARTURE_TIME = col_character(),
  WHEELS_OFF = col_character(),
  WHEELS_ON = col_character(),
  SCHEDULED_ARRIVAL = col_character(),
  ARRIVAL_TIME = col_character(),
  CANCELLATION_REASON = col_character()
)
See spec(...) for full column specifications.

In [6]:
suficientes %>% head

  MONTH AIRLINE n
1 1     AA       9
2 1     AS       2
3 1     B6       3
4 1     DL      19
5 1     EV       5
6 1     F9       1

In [10]:
head(res1)

  MONTH AIRLINE n
1 1     AA       9
2 1     AS       2
3 1     B6       3
4 1     DL      19
5 1     EV       5
6 1     F9       1

In [38]:
#Agora, iremos ver os os voos mensais por companhia aérea:

computeStats = function(input)
    input %>% group_by(AIRLINE, MONTH) %>%
        summarise(n=sum(n))
suficientes %>% computeStats

    AIRLINE MONTH n
1   AA       1     90
2   AA       2     50
3   AA       3    100
4   AA       4    100
5   AA       5     90
6   AA       6     60
7   AA       7    180
8   AA       8    110
9   AA       9    170
10  AA      10    160
11  AA      11    180
12  AA      12    220
13  AS       1     20
14  AS       2     30
15  AS       3     10
16  AS       4     50
17  AS       5     20
18  AS       6     40
19  AS       7     10
20  AS       8     40
21  AS      10     30
22  AS      11     10
23  AS      12     10
24  B6       1     30
25  B6       2     40
26  B6       3     30
27  B6       4     30
28  B6       5     30
29  B6       6     30
30  B6       7     30
⋮   ⋮       ⋮     ⋮
122 UA       9    110
123 UA      10     70
124 UA      11     70
125 UA      12     40
126 US       1     50
127 US       2     30
128 US       3     60
129 US       4     70
130 US       5     70
131 US       6     50
132 VX       1     10
133 VX       2     10
134 VX       4     10
135 VX       6     10
136 VX       7     10
137 VX       8     10
138 VX       9     10
139 VX      11     10
140 WN       1    140
141 WN       2    120
142 WN       3    160
143 WN       4    140
144 WN       5    160
145 WN       6    170
146 WN       7    160
147 WN       8    190
148 WN       9    240
149 WN      10    150
150 WN      11    180
151 WN      12    130

In [14]:
#Exemplo 2: Tipos de join

x = data.frame(c1 = c(1,2,3), x1 = rnorm(3))
y = data.frame(c1 = c(0,2,3), y2 = rnorm(3))
x
y

  c1 x1
1 1  -1.207334
2 2   2.618244
3 3  -1.163824

  c1 y2
1 0   1.5711702
2 2  -2.3410132
3 3   0.7706199

In [15]:
#semi_join: todas as colinas da tabela 1; todos os registros da interseção

x %>% semi_join(y, by = "c1")

  c1 x1
1 2   2.618244
2 3  -1.163824

In [16]:
#anti_join: todas as colinas da tabela 1; todos os registros que não existirem da tabela 2

x %>% anti_join(y, by = "c1")

  c1 x1
1 1  -1.207334

In [17]:
#left_join: todas as colunas de ambas as tabelas; todos os registros da esquerda

x %>% left_join(y, by = "c1")

  c1 x1        y2
1 1  -1.207334         NA
2 2   2.618244 -2.3410132
3 3  -1.163824  0.7706199

In [18]:
#right_join: todas as colunas de ambas as tabelas; todos os registros da direita

x %>% right_join(y, by = "c1")

  c1 x1        y2
1 0         NA  1.5711702
2 2   2.618244 -2.3410132
3 3  -1.163824  0.7706199

In [19]:
#inner_join: todas as colunas de ambas as tabelas; todos os registros da interseção

x %>% inner_join(y, by = "c1")

  c1 x1        y2
1 2   2.618244 -2.3410132
2 3  -1.163824  0.7706199

In [20]:
#full_join: todas as colunas de ambas as tabelas; todos os registros de ambas as tabelas

x %>% full_join(y, by = "c1")

  c1 x1        y2
1 1  -1.207334         NA
2 2   2.618244 -2.3410132
3 3  -1.163824  0.7706199
4 0         NA  1.5711702

In [ ]:
#Primeiramente devemos identificar a chave para fazer a ligação entre as tabelas.
#Se as tabelas tiverem nomes diferentes, fazemos:
#Tabela 1: chama RG; tabela 2: chama RegistroGeral
#x %>% left_join(y, by = "RG"="RegistroGeral")

In [29]:
#Exemplo 3: Gather

taxas = tibble(Pais = c("Brasil", "Argentina"), 
                  "1999" = c(10, 20),
                  "2000" = c(20, 30))
taxas

  Pais      1999 2000
1 Brasil    10   20
2 Argentina 20   30

In [31]:
#A ideia do gather é que o nome das colunas são os valores de uma variável
#Aqui estamos dizendo o nome das colunas explicitamente

taxas %>% gather(Ano, Valor, "1999":"2000")

  Pais      Ano  Valor
1 Brasil    1999 10
2 Argentina 1999 20
3 Brasil    2000 20
4 Argentina 2000 30

In [32]:
#Ou então podemos selecionar todas a colunas MENOS A COLUNA PAÍS
taxas %>% gather(Ano, Valor, -Pais)

  Pais      Ano  Valor
1 Brasil    1999 10
2 Argentina 1999 20
3 Brasil    2000 20
4 Argentina 2000 30

In [36]:
#Exemplo 4: Spread

dat2 = tibble(Pais=c("Brasil", "Brasil", 
                     "Argentina", "Argentina"),
             Obs=c("Casos", "Populacao", "Casos", "Populacao"),
             Qtde = c (10, 100000000, 1, 10000000))
dat2

  Pais      Obs       Qtde
1 Brasil    Casos     1e+01
2 Brasil    Populacao 1e+08
3 Argentina Casos     1e+00
4 Argentina Populacao 1e+07

In [37]:
#Não está no formato tidy. Para consertá-lo, utilizamos o comando spread!

dat2 %>% spread(Obs, Qtde)

  Pais      Casos Populacao
1 Argentina  1    1e+07
2 Brasil    10    1e+08